{
	"cards": [
	{
		"title": "Bio",
		"color": "#f44",
		"paragraphs": [
			"Ever since I was young, I have always been eager to discover, learn, and make components of the world around me.",
			"This started with the creation of a Pokémon fan website in 2005, involving HTML, CSS, and and a PHP-based content management system. Most of my learning at this time was from trial and examples - I rarely understood the exact theory behind my work. I was able to maintain and update this website with content for several years, garnering many visitors over its lifespan. Later on in middle school, I joined my school's FIRST Lego League robotics team and I was instantly hooked, and more importantly, I had finally discovered engineering.",
			"In high school, I developed my love for engineering even more, finding myself participating in programming competitions, exploring data structures and algorithms, learning new languages, and working on coding projects in my spare time, all while taking rigorous math and science classes. Based on my loves of programming and physics, as well as my participation on the high school robotics team, I decided to study computer engineering.",
			"Meanwhile, I had also participated greatly in my high school's band program as a trumpet player. From when I started playing in 2006, I strived to improve and participate as much as I could in music, appearing in many different honor bands, national competitions, and all-state groups. Even though I am not pursuing a program in music, I still participate in ensembles at OSU today and credit music for developing my work ethic and leadership abilities.",
			"At The Ohio State University thus far I learn everything I can both inside and outside of class. The first year involved being an active member of several engineering clubs, winning the Fundamentals of Engineering Honors robot competition, developing image processing plugins for the medical imaging department, and creating the prototype for a student-run startup, all while working on side projects to understand the fundamentals of web, microcontroller, and mobile development. The coming year promises even more exciting opportunities, and I can't wait to see what's in store.",
			"This past summer I found myself in Silicon Valley for the first time working an engineering internship at BloomReach. Out here, I have met many different types of people and found myself immersed in new technologies I had never heard of before, both inside and outside of work. The summer also included going to Maker Faire and participating in three hackathons, and as a result I am inspired to make even more of a difference in the world."
		]
	},
	{
		"title": "My Interests",
		"color": "#f44",
		"paragraphs": [
			"As a computer engineering student, I love working on any electronics projects I can get my hands on. Particularly I have worked on Arduino projects due to their accessibility, and have used this as a springboard to learn more advanced electronics concepts, such as 555 timers and the i2c protocol.",
			"I also have developed a passion and skill for web development over the past year. Upon learning about web frameworks such as Django and Meteor and new client-side libraries such as AngularJS and Polymer, I've worked on web projects frequently both on my own and at hackathons. I can see myself in the future possibly using these skills so also create the interfaces for IoT projects."
		]
	}
	]
}
